Reports/ВедомостьПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ВедомостьПоИсполнительнымЛистам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

CalculationRegisters/Удержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<CalculationRegister>
		<Properties>
			<Name>Удержания</Name>
			<Comment>(Регл)</Comment>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Удержания</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезультатУпр</Name>
					<Comment>в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьПервичныйРезультат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель4</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Показатель6</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Авторасчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРазмер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПериодРасчетаСреднегоЗаработкаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДатаНачалаСобытия</Name>
					<Comment>Дата начала события, оплачиваемого по среднему заработку</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>true</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

InformationRegisters/КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.СервисныеЦентры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьТабельныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВРеглУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПринятНаНовоеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РаботаСНефиксированнымРабочимВременем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УдалитьПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСозданияРабочегоМеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНовогоРабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНовыхРабочихМест</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяКЗоТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольненийИзОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьФизлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьПриказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриемНаРаботуВОрганизацию</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВедомостьПоИсполнительнымЛистам/Ext/ObjectModule.bsl
#Если Клиент Тогда

// Настройка периода
Перем НП Экспорт;



// Возвращает список алгоритмов основных начислений
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокСтатьиНалоговыхДекларацийПоВзносамРаботников() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ПФ_Сотр15);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССБезработ_Сотр);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Сотр025);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Сотр05);
	СписокСпособов.Добавить(Справочники.СтатьиНалоговыхДеклараций.ФССУтрТрудосп_Сотр1);
	
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокСтатьиНалоговыхДекларацийПоВзносамРаботников()


// Возвращает список видов расчетов исполнительных листов
//
// Параметры
//  нет
//
// Возвращаемое значение:
//   Список значений, содержащий подходящий перечень значений перечисления СпособыРасчетаОплатыТруда
//
Функция ПолучитьСписокСпособовРасчетовИспонителныеЛисты() Экспорт
	
	СписокСпособов = Новый СписокЗначений;
	
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнителныйЛистСУчетомОграничения);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистПроцентомДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.ИсполнительныйЛистФиксСуммойДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентом);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыПроцентомДоПредела);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммой);
	СписокСпособов.Добавить(Перечисления.СпособыРасчетаОплатыТруда.АлиментыФиксСуммойДоПредела);
	
	Возврат СписокСпособов
	
КонецФункции // ПолучитьСписокСпособовРасчетовИспонителныеЛисты()


//============================================================================================



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ 
// 

Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	
	ДатаНач = ОбщийОтчет.ДатаНач;
	ДатаКон = ОбщийОтчет.ДатаКон;

	
	Измерение = Новый Массив(2);
	Измерение[0] = "Сотрудник";
	Измерение[1] = "Организация"; 	
		
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ИзмОсн",Измерение);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ИзмБаз",Измерение);
	  
	КонецПериода = КонецДня(КонецМесяца(ОбщийОтчет.ДатаНач));
  
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "НачалоПериода", ОбщийОтчет.ДатаНач );
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "КонецПериода", КонецПериода );
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ПериодРегистрации", НачалоМесяца(ОбщийОтчет.ДатаНач));

	СписокСпособовРасчета = ПолучитьСписокСпособовРасчетовИспонителныеЛисты(); 
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СписокВидовРасчета", 	СписокСпособовРасчета);


	СписокВидовРасчетаПроцентов = Новый СписокЗначений;
	Элемент = ПланыВидовРасчета.Удержания.ПочтовыйСбор;
	СписокВидовРасчетаПроцентов.Добавить(Элемент);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СписокВидовРасчетаПроцентов", СписокВидовРасчетаПроцентов);
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "ВидКонтактнойИнформации", Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента);
  
	
	СписокНалоговыхДеклараций =ПолучитьСписокСтатьиНалоговыхДекларацийПоВзносамРаботников();
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить( "СписокНалоговыхДеклараций", СписокНалоговыхДеклараций);
	
	ОбщийОтчет.ПостроительОтчета.Макет = Неопределено;
		
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры // СформироватьОтчет()

// Процедура - заполняет начальные настройки отчета
//
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	ОбщийОтчет.ВыводитьДополнительныеПоляВОтдельнойКолонке = Истина;		
	
	Текст = 
	"ВЫБРАТЬ
	|	УдержанияБаза.РезультатБаза 									КАК НачисленнаяЗП,
	|	УдержанияБаза.ВидРасчета 										КАК ВидРасчета,
	|	УдержанияБаза.Сотрудник											КАК Сотрудник,
	|	УдержанияБаза.ФизЛицо											КАК ФизЛицо,
	|	УдержанияБаза.ДокументОснование 								КАК ДокументОснование,
	|	ИсполнительныйЛист.ВидИсполнительногоДокумента 					КАК ВидИсполнительногоДокумента,
	|	ИсполнительныйЛист.Получатель 									КАК Получатель,
	|	ВзаиморасчетыПоНДФЛОбороты.НалогПриход 							КАК НДФЛ,
	|	ВзносыВФонды.Результат								 			КАК СуммаВзносов,
	|	УдержанияРаботниковОрганизацийПроценты.Результат 				КАК СуммаПроцент,
	|	ВЫБОР
	|		Когда УдержанияРаботниковОрганизацийПроценты.Результат ЕСТЬ NULL 
	|			Тогда УдержанияРаботниковОрганизаций.Результат
	|		Иначе
	|			УдержанияРаботниковОрганизаций.Результат + УдержанияРаботниковОрганизацийПроценты.Результат
	|		КОНЕЦ 														КАК СуммаПоЛисту,
	|	
	|	ВЫБОР
	|		Когда УдержанияРаботниковОрганизацийПроценты.Результат ЕСТЬ NULL 
	|			Тогда УдержанияБаза.РезультатБаза - УдержанияРаботниковОрганизаций.Результат - ВзаиморасчетыПоНДФЛОбороты.НалогПриход - ВзносыВФонды.Результат 
	|		Иначе
	|			УдержанияБаза.РезультатБаза - УдержанияРаботниковОрганизаций.Результат - УдержанияРаботниковОрганизацийПроценты.Результат - ВзаиморасчетыПоНДФЛОбороты.НалогПриход - ВзносыВФонды.Результат
	|		КОНЕЦ 														КАК СуммаКВыдаче, 
	|	РаботникиОрганизацииСрезПоследних.Организация					КАК Организация,
	|	РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации 		КАК Подразделение,
	| РаботникиОрганизацииСрезПоследних.Сотрудник.Код 					КАК ТабельныйНомер,
	| Реквизиты.Счет  													КАК Счет,
	| Реквизиты.НомерСчета 												КАК НомерСчета,
	| Реквизиты.Банк 													КАК Банк,
	| Реквизиты.Адрес 													КАК Адрес
	|
	| {
	| ВЫБРАТЬ 
	|  РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.* КАК Подразделение,
	|  РаботникиОрганизацииСрезПоследних.Организация.* КАК Организация,
	|  ИсполнительныйЛист.ВидИсполнительногоДокумента.* КАК ВидИсполнительногоДокумента,
	|  РаботникиОрганизацииСрезПоследних.Сотрудник.Код.* КАК ТабельныйНомер,
	|  Реквизиты.Счет.* КАК Счет,
	|  Реквизиты.НомерСчета.* КАК НомерСчета,
	|  Реквизиты.Банк.* КАК Банк,
	|  Реквизиты.Адрес КАК Адрес  
	| }
	|ИЗ
	|	(
	|   ВЫБРАТЬ
	|		УдержанияБазаОсновныеНРО.РезультатБаза 		КАК РезультатБаза,
	|		УдержанияБазаОсновныеНРО.ВидРасчета 		КАК ВидРасчета,
	|		УдержанияБазаОсновныеНРО.Сотрудник			КАК Сотрудник,
	|		УдержанияБазаОсновныеНРО.Сотрудник.ФизЛицо 	КАК ФизЛицо,
	|		УдержанияБазаОсновныеНРО.ДокументОснование 	КАК ДокументОснование,
	|		УдержанияБазаОсновныеНРО.ДокументОснование.Ссылка КАК ДокументОснованиеСсылка
	|	ИЗ
	|		РегистрРасчета.Удержания.БазаНачисления(&ИзмОсн, &ИзмБаз, , ВидРасчета.СпособРасчета В (&СписокВидовРасчета) И ПериодРегистрации = &ПериодРегистрации) КАК УдержанияБазаОсновныеНРО
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		УдержанияБазаДополнительныеНРО.РезультатБаза,
	|		УдержанияБазаДополнительныеНРО.ВидРасчета,
	|		УдержанияБазаДополнительныеНРО.Сотрудник,
	|		УдержанияБазаДополнительныеНРО.Сотрудник.ФизЛицо,
	|		УдержанияБазаДополнительныеНРО.ДокументОснование,
	|		УдержанияБазаДополнительныеНРО.ДокументОснование.Ссылка
	|	ИЗ
	|		РегистрРасчета.Удержания.БазаНачисления(&ИзмОсн, &ИзмБаз, , ВидРасчета В (&СписокВидовРасчета) И ПериодРегистрации = &ПериодРегистрации) КАК УдержанияБазаДополнительныеНРО
	|    ) КАК УдержанияБаза
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнительныйЛист КАК ИсполнительныйЛист
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				Контрагенты.ОсновнойБанковскийСчет КАК Счет,
	|				КонтактнаяИнформация.Представление КАК Адрес,
	|				Контрагенты.Ссылка КАК Контрагент,
	|				Контрагенты.ОсновнойБанковскийСчет.НомерСчета КАК НомерСчета,
	|				Контрагенты.ОсновнойБанковскийСчет.Банк КАК Банк
	|			ИЗ
	|				Справочник.Контрагенты КАК Контрагенты
	|					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|					ПО КонтактнаяИнформация.Объект = Контрагенты.Ссылка
  	|
	|			ГДЕ
	|				КонтактнаяИнформация.Вид = &ВидКонтактнойИнформации) КАК Реквизиты				
	|			ПО ИсполнительныйЛист.Получатель = Реквизиты.Контрагент
	|		ПО УдержанияБаза.ДокументОснование = ИсполнительныйЛист.Ссылка
  	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВзносыВФонды КАК ВзносыВФонды
	|		ПО	УдержанияБаза.Сотрудник = ВзносыВФонды.Сотрудник
	//|		И	ВзносыВФонды.Организация = УдержанияБаза.Организация
	|		И	ВзносыВФонды.ПериодРегистрации <= &НачалоПериода
  	|       И	ВзносыВФонды.ПериодРегистрации >= &КонецПериода
  	|       И	ВзносыВФонды.СтатьяНалоговойДекларации В (&СписокНалоговыхДеклараций)
  	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВзаиморасчетыПоНДФЛ.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВзаиморасчетыПоНДФЛОбороты
	|		ПО УдержанияБаза.Сотрудник = ВзаиморасчетыПоНДФЛОбороты.Сотрудник
	//|		И УдержанияБаза.Организация = УдержанияБаза.Организация
  	|
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизаций
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.Удержания КАК УдержанияРаботниковОрганизацийПроценты
	|			ПО УдержанияРаботниковОрганизаций.ДокументОснование = УдержанияРаботниковОрганизацийПроценты.ДокументОснование
	|			И  УдержанияРаботниковОрганизацийПроценты.ВидРасчета В (&СписокВидовРасчетаПроцентов) 
	|		ПО УдержанияБаза.ВидРасчета = УдержанияРаботниковОрганизаций.ВидРасчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций.СрезПоследних(&КонецПериода, ) КАК РаботникиОрганизацииСрезПоследних
	|		ПО УдержанияБаза.Сотрудник = РаботникиОрганизацииСрезПоследних.Сотрудник
	|
	|ГДЕ                                                                               
	//|	УдержанияРаботниковОрганизацийПроценты.ВидРасчета В(&СписокВидовРасчетаПроцентов) И
	|	УдержанияРаботниковОрганизаций.ПериодРегистрации = &ПериодРегистрации
	|И	(УдержанияРаботниковОрганизацийПроценты.Результат ЕСТЬ NULL ИЛИ УдержанияРаботниковОрганизацийПроценты.ПериодРегистрации = &ПериодРегистрации)
	|	{ГДЕ РаботникиОрганизацииСрезПоследних.ПодразделениеОрганизации.* КАК Подразделение,
	|	РаботникиОрганизацииСрезПоследних.Организация.* КАК Организация,
	|	ИсполнительныйЛист.СпособПеречисления.* КАК ВидОплаты}
	| ИТОГИ СУММА(НачисленнаяЗП),
	|       СУММА(НДФЛ),
	|	      СУММА(СуммаВзносов),
	|	      СУММА(СуммаКВыдаче),
	|	      СУММА(СуммаПроцент),
	|	      СУММА(СуммаПоЛисту)          
	|                           ПО ОБЩИЕ,
	|                              Подразделение, 
	|                              Сотрудник,
	|								ФизЛицо,
	|  						                 Получатель, 
	|											         ВидИсполнительногоДокумента,
	|                              ДокументОснование
	|													  
	|
	|{ИТОГИ ПО
	|	      Организация.*, Подразделение.*, ФизЛицо.*, Получатель.*, ВидИсполнительногоДокумента.* , ДокументОснование.* }
  	|";

			
	
	СтруктураПредставлениеПолей = Новый Структура;
	
	СтруктураПредставлениеПолей.Вставить( "Подразделение",       НСтр("ru='Подразделение';uk='Підрозділ'"));
	СтруктураПредставлениеПолей.Вставить( "ФизЛицо",             НСтр("ru='ФИО плательщика';uk='ПІБ платника'"));
	СтруктураПредставлениеПолей.Вставить( "Получатель",          НСтр("ru='ФИО получателя';uk='ПІБ отримувача'"));
  	СтруктураПредставлениеПолей.Вставить( "ВидИсполнительногоДокумента", НСтр("ru='Вид исполнительного документа';uk='Вид виконавчого документа'"));
  	СтруктураПредставлениеПолей.Вставить( "ДокументОснование",   НСтр("ru='Документ основание';uk='Документ підстава'"));
  	СтруктураПредставлениеПолей.Вставить( "ТабельныйНомер", НСтр("ru='Табельный номер';uk='Табельний номер'"));
  	СтруктураПредставлениеПолей.Вставить( "Счет", НСтр("ru='Банковский счет получателя';uk='Банківський рахунок одержувача'"));
  	СтруктураПредставлениеПолей.Вставить( "Адрес", НСтр("ru='Адрес получателя';uk='Адреса одержувача'"));
  	СтруктураПредставлениеПолей.Вставить( "НомерСчета", НСтр("ru='Номер счета';uk='Номер рахунку'"));
  	СтруктураПредставлениеПолей.Вставить( "Банк", НСтр("ru='Наименование банка';uk='Найменування банку'"));

  	
	ПостроительОтчета.Текст = Текст;
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);	
	УправлениеОтчетами.ОчиститьДополнительныеПоляПостроителя(ПостроительОтчета);
	

	ОбщийОтчет.ЗаполнитьПоказатели( "НачисленнаяЗП",       НСтр("ru='Начисленная З/П';uk='Нарахована З/П'"),                Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "НДФЛ",                НСтр("ru='НДФЛ';uk='ПДФО'"),                           Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаВзносов",        НСтр("ru='Сумма взносов';uk='Сума внесків'"),                  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаПоЛисту",        НСтр("ru='Удержания по исполнительному листу';uk='Утримання по виконавчому листу'"),  Истина, "ЧЦ=15; ЧДЦ=2");
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаПроцент",        НСтр("ru='Процент почты';uk='Відсоток пошти'"),                  Истина, "ЧЦ=15; ЧДЦ=2");	
	ОбщийОтчет.ЗаполнитьПоказатели( "СуммаКВыдаче",        НСтр("ru='Сумма к выдаче';uk='Сума до видачі'"),                 Истина, "ЧЦ=15; ЧДЦ=2");
	
	
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Подразделение");
	МассивОтбора.Добавить("Организация");
	МассивОтбора.Добавить("ВидОплаты");
	
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	ОбщийОтчет.мСтруктураНевыводимыхГруппировок = Новый Структура("Общие")
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры // Настроить()

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет  = ЭтотОбъект;	
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

ОбщийОтчет.ИмяРегистра          = "-";
ОбщийОтчет.мНазваниеОтчета      = НСтр("ru='Общая ведомость по исполнительным документам';uk='Загальна відомість за виконавчими документами'");
ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
ОбщийОтчет.РаскрашиватьИзмерения = Истина;
ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
ОбщийОтчет.мРежимВводаПериода = 2; // Период в месяц

#КонецЕсли
